---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.DefaultSetback
source: html/ce7bd53f-64f0-43b2-cf68-c24bdae7b735.htm
---
# Autodesk.Revit.DB.WallSweepInfo.DefaultSetback Property

The sweep setback distance from inserts, such as windows and doors.

## Syntax (C#)
```csharp
public double DefaultSetback { get; set; }
```